In [1]:
import pandas as pd
data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [ ]:
df.rename(columns={'First Name': 'first_name', 'Age': 'age'}, inplace=True)

In [5]:
df.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [7]:
print(df.age.mean())

32.5

In [ ]:
df[['first_name', 'City']]

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [10]:
df['Salary']= [50000, 60000, 70000, 80000]
df

  first_name  age           City  Salary
0      Alice   25       New York   50000
1        Bob   30  San Francisco   60000
2    Charlie   35    Los Angeles   70000
3      David   40        Chicago   80000

In [11]:
df.describe()

             age        Salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [12]:
sales_and_expenses = {'Month': ['Jan', 'Feb', 'Mar', 'Apr'], 'Sales': [5000, 6000, 7500, 8000], 'Expenses': [3000, 3500, 4000, 4500]}
df2 = pd.DataFrame(sales_and_expenses)
df2

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [19]:
print(f"Max Sales= {df2['Sales'].max()}, Max expenses= {df2['Expenses'].max()}")

Max Sales= 8000, Max expenses= 4500

In [20]:
print(f"Min Sales= {df2['Sales'].min()}, Min expenses= {df2['Expenses'].min()}")

Min Sales= 5000, Min expenses= 3000

In [21]:
print(f"Average Sales= {df2['Sales'].mean()}, Average expenses= {df2['Expenses'].mean()}") #df2['Sales'].mean(), df2['Expenses'].mean()

Average Sales= 6625.0, Average expenses= 3750.0

In [22]:
expenses = {'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'], 'January': [1200, 200, 300, 150], 'February': [1300, 220, 320, 160], 'March': [1400, 240, 330, 170], 'April': [1500, 250, 350, 180]}
df3 = pd.DataFrame(expenses)
df3

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    170    180

In [23]:
df3.set_index('Category', inplace=True)
df3

               January  February  March  April
Category
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    330    350
Entertainment      150       160    170    180

In [ ]:
max_expenses = df3.max(axis=1)
print(max_expenses)

Category
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

In [32]:
min_expenses = df3.min(axis=1)
print(min_expenses)

Category
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

In [33]:
avg_expenses = df3.mean(axis=1)
print(avg_expenses)

Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64